#include "borderMenu.h"

#define WIDTH 84
#define HEIGHT 19

void ShowBorder()
{
	printf("¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á          ¡á¡á¡á¡á ¡á¡á¡á¡á ¡á¡á¡á¡á     ¡á     ¡á¡á¡á   ¡á¡á¡á¡á           ¡á\n");
	printf("¡á          ¡á       ¡á       ¡á          ¡á¡á    ¡á    ¡á ¡á                 ¡á\n");
	printf("¡á          ¡á¡á¡á¡á ¡á¡á¡á¡á ¡á         ¡á  ¡á   ¡á¡á¡á   ¡á¡á¡á¡á           ¡á\n");
	printf("¡á          ¡á             ¡á ¡á        ¡á¡á¡á¡á  ¡á       ¡á                 ¡á\n");
	printf("¡á          ¡á¡á¡á¡á ¡á¡á¡á¡á ¡á¡á¡á¡á ¡á      ¡á ¡á       ¡á¡á¡á¡á           ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                  ¡á      ¡á     ¡á     ¡á¡á¡á¡á ¡á¡á¡á¡á                   ¡á\n");
	printf("¡á                  ¡á¡á  ¡á¡á    ¡á¡á        ¡á   ¡á                         ¡á\n");
	printf("¡á                  ¡á  ¡á  ¡á   ¡á  ¡á      ¡á    ¡á¡á¡á¡á                   ¡á\n");
	printf("¡á                  ¡á      ¡á  ¡á¡á¡á¡á    ¡á     ¡á                         ¡á\n");
	printf("¡á                  ¡á      ¡á ¡á      ¡á ¡á¡á¡á¡á ¡á¡á¡á¡á                   ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");
}


void StageBorder1()
{
	printf("¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");                                                                       
	printf("¡á¡å¡å¡å¡å¡å¡å¡å¡å¡å¡å¡å¡å                ¡å¡å¡å¡å¡å¡å¡å¡å¡å¡å¡å¡å            ¡á\n");
	printf("¡á                          ¡ã¡ã¡ã¡ã¡ã¡ã                                  ¡Ú  ¡á\n");
	printf("¡á  ¢¸¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");
	printf("¡á  ¢¸¡á      ¢¸¡á¡å¡å¡å¡å¡å¡å                                                ¡á\n");
	printf("¡á  ¢¸¡á  ¡á  ¢¸¡á              ¡á¡á  ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");
	printf("¡á  ¢¸¡á  ¡á  ¢¸¡á              ¡á¢º                                          ¡á\n");
	printf("¡á  ¢¸¡á  ¡á  ¢¸¡á              ¡á¢º  ¡á                          ¡á¡á¡á¡á¡á¡á¡á\n");
	printf("¡á        ¡á        ¡ã¡ã¡ã¡ã¡ã¡ã¡á¢º  ¡á                          ¡á          ¡á\n");
	printf("¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á  ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á          ¡á\n");	
	printf("¡á                                                                            ¡á\n");
	printf("¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");
}

void GameOverBorder()
{
	printf("¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                   ¡á¡á¡á¡á     ¡á     ¡á      ¡á ¡á¡á¡á¡á                  ¡á\n");
	printf("¡á                   ¡á          ¡á¡á    ¡á¡á  ¡á¡á ¡á                        ¡á\n");
	printf("¡á                   ¡á  ¡á¡á   ¡á  ¡á   ¡á  ¡á  ¡á ¡á¡á¡á¡á                  ¡á\n");
	printf("¡á                   ¡á    ¡á  ¡á¡á¡á¡á  ¡á  ¡á  ¡á ¡á                        ¡á\n");
	printf("¡á                   ¡á¡á¡á¡á ¡á      ¡á ¡á  ¡á  ¡á ¡á¡á¡á¡á                  ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                     ¡á¡á   ¡á      ¡á ¡á¡á¡á¡á ¡á¡á¡á¡á                    ¡á\n");
	printf("¡á                   ¡á    ¡á  ¡á    ¡á  ¡á       ¡á      ¡á                  ¡á\n");
	printf("¡á                   ¡á    ¡á   ¡á  ¡á   ¡á¡á¡á¡á ¡á¡á¡á¡á                    ¡á\n");
	printf("¡á                   ¡á    ¡á    ¡á¡á    ¡á       ¡á     ¡á                   ¡á\n");
	printf("¡á                     ¡á¡á       ¡á     ¡á¡á¡á¡á ¡á      ¡á                  ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á                                                                            ¡á\n");
	printf("¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n");
}
