#include "borderMenu.h"

void ShowBorder()
{
	printf("бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс\n");
	printf("бс                                                                            бс\n");
	printf("бс                                                                            бс\n");
	printf("бс          бсбсбсбс бсбсбсбс бсбсбсбс     бс     бсбсбс   бсбсбсбс           бс\n");
	printf("бс          бс       бс       бс          бсбс    бс    бс бс                 бс\n");
	printf("бс          бсбсбсбс бсбсбсбс бс         бс  бс   бсбсбс   бсбсбсбс           бс\n");
	printf("бс          бс             бс бс        бсбсбсбс  бс       бс                 бс\n");
	printf("бс          бсбсбсбс бсбсбсбс бсбсбсбс бс      бс бс       бсбсбсбс           бс\n");
	printf("бс                                                                            бс\n");
	printf("бс                                                                            бс\n");
	printf("бс                                                                            бс\n");
	printf("бс                бс      бс     бс     бсбсбсбс бсбсбсбс                     бс\n");
	printf("бс                бсбс  бсбс    бсбс        бс   бс                           бс\n");
	printf("бс                бс  бс  бс   бс  бс      бс    бсбсбсбс                     бс\n");
	printf("бс                бс      бс  бсбсбсбс    бс     бс                           бс\n");
	printf("бс                бс      бс бс      бс бсбсбсбс бсбсбсбс                     бс\n");
	printf("бс                                                                            бс\n");
	printf("бс                                                                            бс\n");
	printf("бс                                                                            бс\n");
	printf("бс                                                                            бс\n");
	printf("бс                                                                            бс\n");
	printf("бс                                                                            бс\n");
	printf("бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс\n");
}